<script setup lang="ts">
definePageMeta({layout: 'guest'})
const items = [{
  label: 'Как я могу опубликовать мем на вашем сайте?',
  defaultOpen: true,
  content: 'Мы принимаем мемы только если ты прошёл испытание мемологией. Заполни анкету, пожми лапку мемному коту и дождись, пока мемы одобрят наши модераторы – суровые, но справедливые автомемы.'
}, {
  label: 'Что делать, если мой мем не набирает лайки?',
  content: 'Возможно, твой мем слишком гениален для обычных смертных. Попробуй добавить котиков, они всегда в тренде. Или присваивай мемным фразам больше капслока.'
}, {
  label: 'Как мне стать популярным мемологом?',
  content: 'Сначала стань мастером искусства кадра и шуточки. Ну а затем – активно лайкай, комментируй и делись чужими мемами, так тебя быстрее заметят. Придётся полюбить сову в 3 утра.'
}, {
  label: 'Можно ли сохранять мемы других пользователей?',
  content: 'Да, но не забывай о святости мемной этики! Указывай автора и отправляй мысленные лучи добра и ржача в его сторону.'
}, {
  label: 'Что делать, если загруженный мной мем кого-то обидел?',
  content: 'Эх, мемологии — это тонкая наука. Удалим мем, как только ты скажешь "Сорян, ребят". Просто свяжись с нашей поддержкой через форму "Помощь" или отправь письмо ворчливому коту администратору.'
}, {
  label: 'Как стать частью вашей мем-команды?',
  content: 'Ты ведь умеешь реагировать на сообщения мемами быстрее, чем Пикачу кастует "Молнию", да? Если так, напиши нам о своём желании, и мы проведём мем-интервью в нашем разделе "Вакансии".'
}, {
  label: 'Можно ли похвалить ваш сайт за восхитительные мемы?',
  content: 'Пожалуйста, не стесняйся, как Иннокентий, впервые на детской площадке! Мы всегда рады вашему фидбеку. Заходи в раздел "Отзывы" и оставь своё мнение, а также смело делись мемами в соцсетях с хештегом #МемОратор.'
}, {
  label: 'А что делать, если нашёл баг на сайте?',
  content: 'Мы сразу отправим кота-программиста чинить всё! Но для начала напиши нам через форму "Сообщить об ошибке". Чем точнее информация, тем быстрее будет порядок. Как сказал бы вечно удивлённый кодер: "Это не баг, это фича!"'
}]
</script>

<template>

  <app-application-bar>
    <template #left>
      <u-button size="lg" color="gray" variant="ghost" icon="i-ph-arrow-left-bold" @click="$router.back()"/>
      <div class="text-lg font-bold">Вопросы и ответы</div>
    </template>
  </app-application-bar>
  <div class="max-w-3xl mx-auto space-y-2 py-2 px-2 md:px-0">
    <UAccordion :items="items" :ui="{ wrapper: 'flex flex-col w-full' }">
      <template #default="{ item, index, open }">
        <UButton color="gray" variant="ghost" class="border-b border-gray-200 dark:border-gray-700"
                 :ui="{ rounded: 'rounded-none', padding: { sm: 'p-3' } }">
          <span class="truncate">{{ index + 1 }}. {{ item.label }}</span>
          <template #trailing>
            <UIcon
              name="i-heroicons-chevron-right-20-solid"
              class="w-5 h-5 ms-auto transform transition-transform duration-200"
              :class="[open && 'rotate-90']"
            />
          </template>
        </UButton>
      </template>
    </UAccordion>
  </div>
</template>

<style scoped>

</style>
